[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.js:65:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
-              {errors.quarterYYYYQ?.type === "pattern" &&
+              {true &&
                 "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
             </Form.Control.Feedback>
killedBy: UCSBDateForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022</div> instead
