[Killed] ConditionalExpression
src/main/utils/currentUser.js:49:7
 
   if (currentUser == null) return false;
 
-  if (currentUser.data?.root?.rolesList) {
+  if (false) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDate/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
